openenergymonitor/STM32/Software/Sombrero_CB_STM32mini/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2021 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f3xx_hal.h"
#include "adc.h"
#include "dma.h"
#include "i2c.h"
#include "opamp.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include <string.h>
//#include "ds18b20.h"
#include <math.h>
#include <stdbool.h>
#include "power.h"
#include "reset.h"
#include "phase.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

// version information
char hwVersion[] = "0.2";
char fwVersion[] = "0.1";



//------------------------------------------------
// timing variables
//------------------------------------------------
uint32_t readings_interval = 500; // millis to read waveform at.
uint32_t posting_interval = 5000; // millis to post data at.

//------------------------------------------------
// misc. flags
//------------------------------------------------
bool first_readings = false;
bool no_volts_flag = false;
// bool readings_ready = false;
bool rpi_connected;
// extern bool conv_halfcplt_flag;
// extern bool conv_cplt_flag;
bool ledBlink = true; // enable or disable LED blinking.



//------------------------
// Channel Results
//------------------------
typedef struct channel_results_
{
  double Vrms;
  double Irms;
  double ApparentPower;
  double RealPower;
  double PowerFactor;
  bool Clipped;
  int Mains_AC_Cycles; // counting complete waveforms
  long SampleCount;
  int Count;
} channel_results_t;

channel_results_t channel_results[CTn] = {0}; //  init the channel results.



//------------------------
// UART SERIAL BUFFERS
//------------------------
#define COMMAND_BUFFER_SIZE 30
char rx_string[COMMAND_BUFFER_SIZE];
char string_buffer[200];
// char log_buffer[500];


//--------------------
// Time variables
//--------------------
uint32_t current_millis;
uint32_t previous_millis_fine;
uint32_t previous_millis_course;
uint32_t time2;
uint32_t time1;
uint32_t time_diff;


//----------------
// MISC
//----------------
static uint32_t pulseCount = 0;
// static uint32_t pulseCount2 = 0;
// extern char json_response[40];
extern int boot_number;


#define MID_ADC_READING 2048



// // Calibration
// float VCAL = 268.97;
// float ICAL = 90.9;

// // Number of waveforms to count
// uint8_t waveforms = 250;

// // ISR accumulators
// typedef struct channel_
// {
//   int64_t sum_P;
//   uint64_t sum_V_sq;
//   uint64_t sum_I_sq;
//   int32_t sum_V;
//   int32_t sum_I;
//   uint32_t count;
  
//   uint32_t positive_V;
//   uint32_t last_positive_V;
//   uint32_t cycles;
// } channel_t;

// #define NUMBER_OF_CHANNELS 3
// static channel_t channels[NUMBER_OF_CHANNELS];
// static channel_t channels_copy[NUMBER_OF_CHANNELS];

// double Ws_acc[NUMBER_OF_CHANNELS] = {0}; // Watt second accumulator

// uint32_t pulseCount = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

// void process_frame(uint16_t offset)
// {
//   int32_t sample_V, sample_I, signed_V, signed_I;

//   HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
//   for (int i = 0; i < 3000; i += NUMBER_OF_CHANNELS)
//   {
//     // Cycle through channels
//     for (int n = 0; n < NUMBER_OF_CHANNELS; n++)
//     {
//       channel_t *channel = &channels[n];

//       // ----------------------------------------
//       // Voltage
//       sample_V = adcV_dma_buff[offset + i + n];
//       signed_V = sample_V - MID_ADC_READING;
//       channel->sum_V += signed_V;
//       channel->sum_V_sq += signed_V * signed_V;
//       // ----------------------------------------
//       // Current
//       sample_I = adcI_dma_buff[offset + i + n];
//       signed_I = sample_I - MID_ADC_READING;
//       channel->sum_I += signed_I;
//       channel->sum_I_sq += signed_I * signed_I;
//       // ----------------------------------------
//       // Power
//       channel->sum_P += signed_V * signed_I;
//       // ----------------------------------------
//       // Sample Count
//       channel->count++;
//       // ----------------------------------------
//       // Zero crossing detection
//       channel->last_positive_V = channel->positive_V;
//       if (signed_V > 5)
//       {
//         channel->positive_V = true;
//       }
//       else if (signed_V < -5)
//       {
//         channel->positive_V = false;
//       }
      
