openenergymonitor/STM32/Software/Sombrero_CB_STM32mini/Src/main.c
//       if (!channel->last_positive_V && channel->positive_V)
//       {
//         channel->cycles++;
//       }

//       // ----------------------------------------
//       // Complete Waveform Cycles to count
//       if (channel->cycles == waveforms)
//       {
//         channel->cycles = 0;

//         channel_t *channel_copy = &channels_copy[n];
//         // Copy accumulators for use in main loop
//         memcpy((void *)channel_copy, (void *)channel, sizeof(channel_t));
//         // Reset accumulators to zero ready for next set of measurements
//         memset((void *)channel, 0, sizeof(channel_t));

//         if (n == NUMBER_OF_CHANNELS - 1)
//         {
//           readings_ready = true;
//         }
//       }
//     }
//   }
//   HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
// }

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  V_SCALE = VCAL * VOLTS_PER_DIV;
  I_SCALE = ICAL * VOLTS_PER_DIV;
  
  int _readings_interval = readings_interval; // temporarily store the usable posting period.
  readings_interval = 100; // speed up first discarded reading.

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_TIM8_Init();
  MX_ADC2_Init();
  MX_USART3_UART_Init();
  MX_I2C1_Init();
  MX_ADC4_Init();
  MX_SPI3_Init();
  MX_OPAMP2_Init();
  /* USER CODE BEGIN 2 */


  HAL_Delay(2000); // time necessary to catch first serial output on firmware launch after flash.
  debug_printf("\r\n\r\nStart, connect VT.\r\n");


  //------------------------
  // RESET CAUSE
  //------------------------
  reset_cause_store = reset_cause_get();
  // while (!usart_tx_ready); // force wait while usart Tx finishes.
  sprintf(log_buffer, "Reset Cause:%s\r\n", reset_cause_get_name(reset_cause_store));
  debug_printf(log_buffer);
  

  //------------------------
  // is the rPi Connected?
  //------------------------
  if (HAL_GPIO_ReadPin(RPI_CONNECTED_GPIO_Port, RPI_CONNECTED_Pin) == 1)
  {
    debug_printf("rPi connected!\r\n");
    // _mode = 1; // rpi mode.
    rpi_connected = true;
  }
  else {
    debug_printf("rPi not connected.\r\n");
    // _mode = 0;
  }


  //------------------------
  // ADC & OPAMP Start
  //------------------------
  HAL_ADCEx_Calibration_Start(&hadc2, ADC_SINGLE_ENDED);
  HAL_ADCEx_Calibration_Start(&hadc4, ADC_SINGLE_ENDED);
  HAL_Delay(2);
  HAL_OPAMP_SelfCalibrate(&hopamp2); 
  HAL_OPAMP_Start(&hopamp2);
  HAL_Delay(2);
  start_ADCs(usec_lag);


  //------------------------
  // Temp Sensor Start
  //------------------------
  //init_ds18b20s(); // temperature sensor
  
  // sensible start times..
  current_millis = HAL_GetTick();
  previous_millis_course = current_millis;
  previous_millis_fine = current_millis;


  // Done Init indcator.
  debug_printf("\r\n.\r\n");

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    current_millis = HAL_GetTick();

    //----------------------------
    // process_ds18b20s();
    //----------------------------


    //------------------------------------------------
    // Short interval for accumulating raw readings.
    //------------------------------------------------
    if (current_millis - previous_millis_fine >= readings_interval) 
    {
      uint16_t correction = current_millis - previous_millis_fine - readings_interval;
      previous_millis_fine = current_millis - correction;

      if (readings_requested) no_volts_flag = true;

      readings_requested = true;

      // RTC debug
      // RTC_CalendarShow(aShowTime, aShowDate);
      // debug_printf((char*)aShowDate); debug_printf("\r\n");
      // debug_printf((char*)aShowTime); debug_printf("\r\n");
    }
    

    //---------------------------------------------------
    // ADC DMA buffer flags. Process ADC Buffer Frames.
    //---------------------------------------------------
    if (conv_hfcplt_flag)
    {
      conv_hfcplt_flag = false;
      process_frame(0); // process 1st half of buffer.
    }
    if (conv_cplt_flag)
    {
      conv_cplt_flag = false;
      process_frame(adc_buff_half_size); // process 2nd half of buffer.
    }
    // HAL_Delay(200); // ADC buffer overrun flag test.


    
    //------------------------------------------------------
    // Calculate human-readable values.. volts, amps etc.
    //------------------------------------------------------
    if (readings_ready)
    {
      readings_ready = false;
      memset(channel_rdy_bools, 0, sizeof(channel_rdy_bools)); // clear flags.

      if (!first_readings) { 
        readings_interval = _readings_interval;
        first_readings = true; 
        previous_millis_course = current_millis;
        
        // while (!usart_tx_ready); // force wait while usart Tx finishes.
        sprintf(log_buffer, "Start Sampling Millis: %ld\r\n", current_millis); // initital write to buffer.
        debug_printf(log_buffer);
        sprintf(log_buffer, "{HardwareVersion:%s,FirmwareVersion:%s}\r\n", hwVersion, fwVersion); // initital write to buffer.
        debug_printf(log_buffer);

        goto EndJump;
      } // discard the first set as beginning of 1st waveform not tracked.
      
      // initital write to buffer. sprintf or similar is crucial to prepare for strcat further along.
      sprintf(log_buffer, "HW:%s,FW:%s\r\n", hwVersion, fwVersion); 
      //debug_printf(log_buffer);

      // CALCULATE POWER
      for (int ch = 0; ch < CTn; ch++)
      {
        channel_t *chn = &channels_ready[ch];
        channel_results_t *chn_result = &channel_results[ch];

